src/main/resources/testschema/request.xml

<soapenv:Envelope
        xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:pws="http://soapproducer.gilboot.com/producingwebservice"
>
    <soapenv:Header/>
    <soapenv:Body>
        <pws:getCountryRequest>
            <pws:name>United Kingdom</pws:name>
        </pws:getCountryRequest>
    </soapenv:Body>
</soapenv:Envelope>